
#Програма. Дана послідовність, що містить від 2 до 20 слів,
#в кожному з яких від 2 до 10 латинських букв; між сусідніми словами -
#не менше одного пробілу, за останнім словом - крапка. Вивести на екран
#всі слова, відмінні від останнього слова, попередньо видаливши з таких
#слів першу букву. 

x = input()
x = x.split()
if 2<=len(x)<=20:
    while True:
        x = input('Введите слова в 1 строке:')
        frr = text.split()
        if len(frr) > 20:
            print('Введите меньше слов: ')
            print()
            continue
        elif len(frr) < 2:
            print('Введите больше слов ')
            print()
            continue
            break
        for i in range(len(frr)):
            n = i.split()
            if len(frr) > 10:
                print('Введите слова с меньшим количеством букв')
                break
            
'''
я, ти, ти, врна, я

ти, ти, врна,

и, и, рна
'''    
